insert into bus_doc_dept_type(id, type_name, parent_id, ancestors, sort)
values (100, '省政府机构', 0, '0', 1),
       (110, '河南省人民政府办公厅', 100, '0,100', 1),
       (120, '省政府组成部门', 100, '0,100', 2),
       (130, '省政府直属特设机构', 100, '0,100', 3),
       (140, '省政府直属机构', 100, '0,100', 4),
       (150, '省政府直属事业单位', 100, '0,100', 5),
       (160, '省政府派出机构', 100, '0,100', 6),
       (170, '省政府部门管理机构', 100, '0,100', 7),
       (200, '高等院校', 0, '0', 2),
       (210, '本科层次院校', 200, '0,200', 1),
       (220, '省管专科院校+省辖市管理的专科学院', 200, '0,200', 2),
       (230, '教育厅直属高校', 200, '0,200', 3),
       (300, '省管企业', 0, '0', 3),
       (310, '重要骨干企业', 300, '0,300', 1),
       (320, '骨干企业', 300, '0,300', 2);


